Autodesk.Revit.RelatedFileUtils.CreateFileFromCloudVersion(Autodesk.Revit.DB.ModelPath,Autodesk.Revit.DB.ModelPath,System.Boolean,Autodesk.Revit.DB.RelatedFileType,System.Int32)
Creates an rvt file from the central model at a specific version
source:
The path of the existing file.
target:
The path of the related file to create.
overwrite:
True means silently overwrite if a file already exists at the target.
False means fail.
relatedFileType:
The type of related file being created.
centralModelVersion:
The version from which to create the local file
Returns:
The result of trying to create the related file.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration

Autodesk.Revit.RelatedFileUtils.CreateRelatedFile(Autodesk.Revit.DB.ModelPath,Autodesk.Revit.DB.ModelPath,System.Boolean,Autodesk.Revit.DB.RelatedFileType)
Creates a file related to an existing file.
source:
The path of the existing file.
target:
The path of the related file to create.
overwrite:
True means silently overwrite if a file already exists at the target.
False means fail.
relatedFileType:
The type of related file being created.
Returns:
The result of trying to create the related file.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration